Repository: pmespace/PMS.COMMON
Catalog: COMMON/Properties/Resources.*.resx
Languages: fr

# CLogExceptionLine
source: line
fr: ligne

# CLogExceptionMethod
source: method
fr: fonction

# CLogExceptionFile
source: file
fr: fichier

# CExceptionStreamDisconnected
source: stream has been disconnected
fr: le canal de communication a été déconnecté

# CExceptionInvalidFormat
source: {s} is an invalid format
fr: {s} a un format invalid

# CExceptionNotImplemented
source: method {0} is not implemented inside object {1}
fr: la fonction {0} n'est pas implémenté dans l'objet {1}

# CExceptionOutOfRange
source: {0} is out of range
fr: {0} est hors limites

# CMiscCannotBeZeroLength
source: string cannot be of zero length
fr: la chaîne de caractères ne peut être de longueur nulle

# CMiscCheckBufferMinMax
source: invalid length - min length={0}; max length={1}; length={2}
fr: longueur invalide - longueur min={0}; longueur max={1}; longueur={2}

# CMiscCheckBufferMinMaxValue
source: invalid length - value={3}; min length={0}; max length={1}; length={2}
fr: longueur invalide - valeur={3}; longueur min={0}; longueur max={1}; longueur={2}

# CMiscInvalidHexadecimalFormat
source: {0} is not a valid hexadecimal value
fr: {0} n'est pas un format hexadécimal

# CMiscInvalidLength
source: {0} is not a valid length (expecting {1})
fr: {0} n'est pas une longueur valide (en attente de {1})

# GeneralUnknown
source: unknown
fr: inconnu(e)

# GeneralYES
source: YES
fr: OUI

# GeneralNO
source: NO
fr: NON

# CSafeListEmpty
source: empty list
fr: liste vide

# CStreamClientConnect
source: attempting to connect to {0}, timeout is {1} second(s)
fr: tentative de connexion à {0}, le timeout est {1} seconde(s)

# CStreamClientConnected
source: connected to {0}
fr: connecté à {0}

# CStreamClientNotConnected
source: client failed to connect to {0}
fr: la connexion à {0} a échoué

# CStreamNoOpenedStream
source: no open stream
fr: aucun canal de communication ouvert

# CStreamWaitingMessageWithTimeout
source: waiting to receive a message from {0}, timeout is {1} millisecond(s)
fr: en attente d'un message en provenance de {0}, le timeout est de {1} milliseconde(s)

# CStreamReceivedEmptyBuffer
source: an empty buffer has been recived
fr: réception d'un buffer vide

# CStreamWaitingMessage
source: waiting to receive a message from {0}
fr: en attente d'un message en provenance de {0}

# CStreamReceivedStringMessage
source: received string message of {0} characters from {1}
fr: réception d'un message texte de {0} charactères en provenance de {1}

# CStreamToString
source: header is {0} bytes long; use header: {1}
fr: longueur du header {0} octets; utiliser le header :{1}

# CStreamIOToString
source: streamIO => connected: {0}; remote end point: {1}; receive buffer size: {2}; receive timeout: {3}
fr: streamIO => connecté: {0}; end point distant: {1}; taille du buffer en réception: {2}; timeout en réception: {3}

# CStreamIOTryingToSendEmptyBuffer
source: trying to send an empty buffer
fr: tentative d'envoi d'un buffer vide

# CStreamIONotAddingHeader
source: not adding header
fr: (sans ajouter de header)

# CStreamIOAddingHeader
source: adding {0} bytes header
fr: en utilisant un header de {0} octets

# CStreamIOSendingMessage
source: sending message of {0} bytes ({1}) to {2}
fr: envoi d'un message de {0} octets ({1}) vers {2}

# CStreamIOFailedSendingMessage
source: failed sending message of {0} bytes ({1}) to {2}
fr: échec de l'envoi d'un message de {0} octets ({1}) vers {2}

# CStreamIOSendingTextMessage
source: sending text message of {0} characters to {1}
fr: envoi d'un message texte de {0} charactères vers {1}

# CStreamIOFailedSendingTextMessage
source: failed sending text message of {0} bytes to {2}
fr: échec de l'envoi d'un message texte de {0} octets vers {2}

# CStreamIOZeroLengthBufferGiven
source: 0 length buffer size given, can't receive any message
fr: un buffer de taille nulle a été donné rendant impossible la réception d'un message

# CStreamIOReceivingFixedSizeBuffer
source: waiting to receive a fixed sized buffer of {0} bytes from {1}
fr: en attente d'un buffer de taille fixe de {0} octets en provenance de {1}

# CStreamIOClientDisconnected
source: client at {0} has been disconnected
fr: le client at l'adresse {0} a été déconnecté

# CStreamIOReceivedUnexpectedEmptyBuffer
source: received un unexpected empty message from {0}
fr: réception inattendue d'un message vide en provenance de {0}

# CStreamIOExpectingBytes
source: expecting {0} bytes
fr: {0} octets étaient attendus

# CStreamIOReceivedMessage
source: received {0} bytes from {1}
fr: réception d'un message de {0} octets en provenance de {1}

# CStreamIOWaitingMessage
source: waiting to receive a buffer with no specific size from {0}
fr: en attente d'un buffer sans taille prédéfinie en provenance de {0}

# CStreamIOReceiveAnnounceOf
source: received announce for message of {0} bytes from {1}
fr: réception d'une annonce de message de {0} octets en provenance de {1}

# CStreamIOReceiveAnnounceOfZero
source: received 0 bytes length announce from {0}
fr: réception d'une annonce de 0 octet en provenance de {0}

# CStreamIOReceivedTextMessage
source: received text message [{0}] from {1}
fr: réception d'un message texte [{0}] en provenance de {1}

# CStreamIOSecurityChainElement
source: chain element {0}: {1}
fr: élément de la chaîne {0}: {1}

# GeneralNotSpecified
source: not specified
fr: non spécifié(e)

# CStreamIOCertificateError
source: certificate error {0}
fr: erreur de certificat {0}

# CStreamSettingsBaseToString
source: receive timeout: {0}; receive buffer: {1}; send timeout: {2}; send buffer: {3}; ssl: {4}
fr: timeout en réception: {0}; buffer en réception: {1}; timeout en émission: {2}; buffer en émission: {3}; ssl: {4}

# CStreamClientSettingsToString
source: endpoint: {0}; servername: {1}; allowed ssl errors: {2}
fr: endpoint: {0}; servername: {1}; erreurs ssl autorisées: {2}

# GeneralInvalidIPAddress
source: invalid IP address {0}:{1}
fr: adresse IP invalide {0}:{1}

# ServerListenerNotAllowedToStart
source: {0} - server not allowed to start
fr: {0} - le serveur n'a pas été autorisé à démarrer

# ServerListenerCreated
source: {0} - server listener created reading port {1}
fr: {0} - le listener du serveur a été créé à l'écoute du port {1}

# ServerListenerFailedToStart
source: {0} - server failed to start
fr: {0} - erreur lors du démarrage du serveur

# ServerListenerNotRunning
source: {0} - server is not running
fr: {0} - le serveur ne s'exécute pas

# ServerListenerHasStopped
source: {0} - server has stopped
fr: {0} - le serveur est arrêté

# GeneralFrom
source: from
fr: en provenance de

# ServerSendingNotification
source: sending notification to {0}{1}
fr: envoi d'une notification vers {0}{1}

# ServerListenerIsShuttingDown
source: {0} - server is shutting down
fr: {0} - le serveur est en cours d'arrêt

# ServerListenerClientConnected
source: {0} - environment for client at {1} is ready
fr: {0} - l'environnement pour le client à l'adresse {1} est prêt

# ServerListenerClientConnectionDeclined
source: {0} - client at {1} has been denied connection
fr: {0} - le client à l'adresse {1} n'a pas été autorisé à se connecter

# ServerListenerFailedToStartThread
source: {0} - failed to start {1} thread for client at {2}
fr: {0} - erreur lors du démarrage du thread {1} pour le client à l'adresse {2}

# ServerListenerThreadHasStopped
source: {0} - thread has stopped
fr: {0} - le thread est arrêté

# ServerListenerThreadIsStopping
source: {0} - thread is stopping
fr: {0} - le thread est en cours d'arrêt

# ServerReceivedStopOrder
source: {0} - thread has received command to stop
fr: {0} - le thread a reçu une demande d'arrêt

# ServerClientIsDisconnecting
source: {0} - client at {1} is disconnecting
fr: {0} - le client à l'adresse {1} est en cours de déconnexion

# GeneralNoAvailableIPAddress
source: no IP address available
fr: aucune adrese IP n'est disponible

# ServerFetchMessageException
source: {0} - fetch message exception
fr: {0} - erreur de récupération d'un message

# ServerStartProcessingRequest
source: {0} - start processing request of {1} bytes
fr: {0} - traitement d'une requête de {1} octets

# ServerSendReply
source: {0} - send reply of {1} bytes
fr: {0} - renvoi d'une réponse de {1} octets

# ServerSendFailed
source: {0} - send failed
fr: {0} - l'envoi du message a échoué

# ServerSendNoReply
source: {0} - message is empty, no reply to return
fr: {0} - le message est vide, aucune réponse à renvoyer

# ServerSendNoRequest
source: {0} - message is empty, no request to send
fr: {0} - le message est vide, aucune requête à renvoyer

# ServerUnknownNonFatalError
source: {0} - unknown non fatal error
fr: {0} - erreur inconnue non fatale

# ServerMessageHidden
source: <MESSAGE HIDDEN>
fr: <MESSAGE MASQUE>

# ServerThreadNotStopped
source: {0} - thread did not stop after {1} seconds, forcing it to stop
fr: {0} - le thread ne s'est pas arrêté après {1} secondes, l'arrêt est forcé

# ServerNotConnected
source: <NOT CONNECTED>
fr: <NON CONNECTE>

# ThreadResult
source: {0} - thread result: {1}
fr: {0} - résultat du thread: {1}

# THreadNoMethodToCall
source: {0} - no thread method to call
fr: {0} - aucune fonction à appeler pour ce thread

# ODBCConnectionString
source: connection string
fr: chaîne de connexion

# ODBCDatabaseStillOpened
source: database {0} is till opened
fr: la base de données {0} est toujours ouverte

# ODBColumnName
source: column name
fr: nom de la colonne

# UIActivityFailedAddingActivity
source: activity {0} could not be added
fr: l'activité {0} n'a pas été ajoutée

# UIActivityInsideActivity
source: while processing activity{0}
fr: durant le traitement de l'activité {0}

# UIActivityToString
source: UIActivity => control: {0}; event: {1}; message: {2}; value: {3}
fr: UIActivity => control: {0}; évènement: {1}; message: {2}; valeur: {3}
